Repository: RameezFlutterDev/Dastkaari
Catalog: lib/l10n/app_*.arb
Languages: ur

source: Manage Inventory
ur: انوینٹری کا انتظام

source: Add Product
ur: پروڈکٹ شامل کریں

source: Update Product
ur: مصنوعات کو اپ ڈیٹ کریں

source: Product Name
ur: پروڈکٹ کا نام

source: Product Description
ur: مصنوعات کی تفصیل

source: Description
ur: تفصیل

source: Price
ur: قیمت

source: Stock Quantity
ur: اسٹاک کی مقدار

source: Category
ur: زمرہ

source: Select category
ur: زمرہ منتخب کریں

# productImages
source: Product Images (Max 5)
ur: پروڈکٹ کی تصاویر (زیادہ سے زیادہ 5)

source: Add Images
ur: تصاویر شامل کریں

# addProductBtn
source: Add Product
ur: پروڈکٹ شامل کریں

# fillAllFields
source: Please fill all fields and add images
ur: براہ کرم تمام فیلڈز کو پُر کریں اور تصاویر شامل کریں

# invalidPriceStock
source: Invalid price or stock quantity
ur: غلط قیمت یا اسٹاک کی مقدار

# productAdded
source: Product added successfully
ur: پروڈکٹ کامیابی سے شامل کر دیا گیا

# productDeleted
source: Product deleted successfully
ur: مصنوعات کامیابی سے حذف ہو گئی

source: Delete Image
ur: تصویر حذف کریں

# deleteConfirm
source: Are you sure you want to delete this image?
ur: کیا آپ واقعی اس تصویر کو حذف کرنا چاہتے ہیں؟

source: Cancel
ur: منسوخ کریں

source: View
ur: دیکھیں

source: Edit
ur: ترمیم کریں

source: Delete
ur: حذف کریں

source: No products found
ur: کوئی مصنوعات نہیں ملیں

# noProductsInCategory
source: No products in {category} category
ur: {category} زمرے میں کوئی مصنوعات نہیں ہیں

# priceLabel
source: Rs {price}
ur: روپے {price}

# stockLabel
source: Stock: {stock}
ur: اسٹاک: {stock}

# statusLabel
source: Status: {status}
ur: حالت: {status}

# activeStatus
source: Active
ur: فعال

# pendingReviewStatus
source: Pending Review
ur: جائزہ کے تحت

source: Wooden Crafts
ur: لکڑی کے دستکاری

source: Pottery
ur: مٹی کے برتن

source: Glassworks
ur: شیشہ سازی

source: Stoneworks
ur: پتھر کی مصنوعات

source: Metalworks
ur: دھات کی مصنوعات

source: Leather Works
ur: چمڑے کی مصنوعات

source: Jewelry
ur: زیورات

source: Textiles
ur: کپڑے

source: Seller Orders
ur: فروش کے آرڈرز

source: Filter by Status
ur: حالت کے لحاظ سے فلٹر کریں

# noOrders
source: No {status} orders
ur: کوئی {status} آرڈرز نہیں

source: Order ID
ur: آرڈر آئی ڈی

# totalAmount
source: Total: Rs {amount}
ur: کل: روپے {amount}

source: Payment: {method}
ur: ادائیگی: {method}

# deliveryAddress
source: Address: {address}
ur: پتہ: {address}

source: Products
ur: مصنوعات

# statusPending
source: pending
ur: زیر التوا

# statusProcessing
source: processing
ur: پروسس ہو رہا ہے

# statusShipped
source: shipped
ur: بھیج دیا گیا

# statusDelivered
source: delivered
ur: پہنچا دیا گیا

# statusCancelled
source: cancelled
ur: منسوخ

# statusAll
source: All
ur: سب

# orderUpdated
source: Order updated to {status}
ur: آرڈر {status} میں اپ ڈیٹ ہو گیا

source: View Product Details
ur: مصنوعات کی تفصیلات دیکھیں
